#+title: Correlation
#+author: Ethan Coe-Renner

* Correlation coefficient

calculate z scores for both axis

r = $\frac{\sum{z_x * z_y}}{n-1}$

r always between -1 and 1

| effect size |       r |
| none        |   0-0.1 |
| small       | 0.1-0.3 |
| medium      | 0.3-0.5 |
| large       |   0.5-1 |


| x | y | z_x = $\frac{x-mean_x}{S_x}$ | z_y = $\frac{y-mean_y}{S_y}$ |
|---+---+------------------------------+------------------------------|
| 1 | 1 |                           -1 |                           -1 |
| 2 | 3 |                            0 |                            0 |
| 3 | 5 |                            1 |                            1 |

mean_x = 2

mean_y = 3

S_x = $\sqrt{\frac{(1-2)^2+(2-2)^2+(3-2)^2}{3-1}}$ = 1

S_y = 2

r = \frac{1+0+1}{2} = 1

#+begin_src R :exports both
  x = c(1,2,3)
  y = c(1,3,5)
  cor(x,y)
#+end_src

#+RESULTS:
: 1

#+begin_src R :results output :exports both
  survey = read.csv("./surveySp2021.csv")

  cor.test(survey$fastest_speed_driven, survey$risk_score)
#+end_src

#+RESULTS:
#+begin_example

	Pearson's product-moment correlation

data:  survey$fastest_speed_driven and survey$risk_score
t = 3.4106, df = 113, p-value = 0.0008998
alternative hypothesis: true correlation is not equal to 0
95 percent confidence interval:
 0.1296454 0.4627284
sample estimates:
      cor 
0.3055034 

#+end_example
